Revit 2027 API
BuiltInFailures.DatumPlaneFailures Class
 Failures about DatumPlane.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DatumPlaneFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class DatumPlaneFailures
Public NotInheritable Class DatumPlaneFailures
public ref class DatumPlaneFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DatumPlaneFailures = class end
The BuiltInFailures.DatumPlaneFailures type exposes the following members.
Properties
Name | Description
ScopeBoxWrongPosition |  The Highlighted Datum cannot be associated with the specified Scope Box because the Datum plane does not intersect the Scope Box.
Top
See Also
Reference
Autodesk.Revit.DB Namespace